## Plan Result (test_apim_appgw)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw"
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw"
        name                              = "cft-apim00-perftest-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/cft-api-mgmt-appgw" -> null
          - name                                = "cft-api-mgmt-appgw" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/probes/cft-api-mgmt-appgw" -> null
          - probe_name                          = "cft-api-mgmt-appgw" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - host_name                           = "cft-mtls-api-mgmt-appgw.perftest.platform.hmcts.net" -> null
          - id                                  = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/cft-mtls-api-mgmt-appgw" -> null
          - name                                = "cft-mtls-api-mgmt-appgw" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/probes/cft-mtls-api-mgmt-appgw" -> null
          - probe_name                          = "cft-mtls-api-mgmt-appgw" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "cft-mtls-api-mgmt-appgw"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "cft-mtls-api-mgmt-appgw"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/cft-api-mgmt-appgw"
          + name                                = "cft-api-mgmt-appgw"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/probes/cft-api-mgmt-appgw"
          + probe_name                          = "cft-api-mgmt-appgw"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      - frontend_port {
          - id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendPorts/port_444" -> null
          - name = "port_444" -> null
          - port = 444 -> null
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendIPConfigurations/appGwPrivateFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPrivateFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendPorts/port_444" -> null
          - frontend_port_name             = "port_444" -> null
          - host_name                      = "cft-mtls-api-mgmt-appgw.perftest.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/cft-mtls-api-mgmt-appgw" -> null
          - name                           = "cft-mtls-api-mgmt-appgw" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = true -> null
          - ssl_certificate_id             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslCertificates/wildcard-perftest-platform-hmcts-net" -> null
          - ssl_certificate_name           = "wildcard-perftest-platform-hmcts-net" -> null
          - ssl_profile_id                 = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslProfiles/cft-mtls-api-mgmt-appgw-sslprofile" -> null
          - ssl_profile_name               = "cft-mtls-api-mgmt-appgw-sslprofile" -> null
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "cft-api-mgmt-appgw.perftest.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/cft-api-mgmt-appgw" -> null
          - name                           = "cft-api-mgmt-appgw" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslCertificates/wildcard-perftest-platform-hmcts-net" -> null
          - ssl_certificate_name           = "wildcard-perftest-platform-hmcts-net" -> null
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "sdtcomm.apps-nle.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/sdtcomm.apps-nle.hmcts.net" -> null
          - name                           = "sdtcomm.apps-nle.hmcts.net" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = true -> null
          - ssl_certificate_id             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslCertificates/civil-sdt-commissioning-nle" -> null
          - ssl_certificate_name           = "civil-sdt-commissioning-nle" -> null
          - ssl_profile_id                 = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslProfiles/cft-mtls-api-mgmt-appgw-sslprofile" -> null
          - ssl_profile_name               = "cft-mtls-api-mgmt-appgw-sslprofile" -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "cft-mtls-api-mgmt-appgw.perftest.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "cft-mtls-api-mgmt-appgw"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-perftest-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "cft-mtls-api-mgmt-appgw-sslprofile"
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendIPConfigurations/appGwPublicFrontendIp"
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendPorts/https"
          + frontend_port_name             = "https"
          + host_name                      = "cft-api-mgmt-appgw.perftest.platform.hmcts.net"
          + host_names                     = []
          + id                             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/cft-api-mgmt-appgw"
          + name                           = "cft-api-mgmt-appgw"
          + protocol                       = "Https"
          + ssl_certificate_id             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslCertificates/wildcard-perftest-platform-hmcts-net"
          + ssl_certificate_name           = "wildcard-perftest-platform-hmcts-net"
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/cft-api-mgmt-appgw" -> null
          - backend_address_pool_name  = "cft-api-mgmt-appgw" -> null
          - backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/cft-api-mgmt-appgw" -> null
          - backend_http_settings_name = "cft-api-mgmt-appgw" -> null
          - http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/cft-api-mgmt-appgw" -> null
          - http_listener_name         = "cft-api-mgmt-appgw" -> null
          - id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/cft-api-mgmt-appgw" -> null
          - name                       = "cft-api-mgmt-appgw" -> null
          - priority                   = 10 -> null
          - rewrite_rule_set_id        = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/cft-api-mgmt-appgw-rewriterule" -> null
          - rewrite_rule_set_name      = "cft-api-mgmt-appgw-rewriterule" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/cft-mtls-api-mgmt-appgw" -> null
          - backend_address_pool_name  = "cft-mtls-api-mgmt-appgw" -> null
          - backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/cft-mtls-api-mgmt-appgw" -> null
          - backend_http_settings_name = "cft-mtls-api-mgmt-appgw" -> null
          - http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/sdtcomm.apps-nle.hmcts.net" -> null
          - http_listener_name         = "sdtcomm.apps-nle.hmcts.net" -> null
          - id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/cft-mtls-api-mgmt-appgw" -> null
          - name                       = "cft-mtls-api-mgmt-appgw" -> null
          - priority                   = 20 -> null
          - rewrite_rule_set_id        = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/cft-mtls-api-mgmt-appgw-rewriterule" -> null
          - rewrite_rule_set_name      = "cft-mtls-api-mgmt-appgw-rewriterule" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/cft-api-mgmt-appgw"
          + backend_address_pool_name  = "cft-api-mgmt-appgw"
          + backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/cft-api-mgmt-appgw"
          + backend_http_settings_name = "cft-api-mgmt-appgw"
          + http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/cft-api-mgmt-appgw"
          + http_listener_name         = "cft-api-mgmt-appgw"
          + id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/cft-api-mgmt-appgw"
          + name                       = "cft-api-mgmt-appgw"
          + priority                   = 10
          + rewrite_rule_set_id        = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/cft-api-mgmt-appgw-rewriterule"
          + rewrite_rule_set_name      = "cft-api-mgmt-appgw-rewriterule"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "cft-mtls-api-mgmt-appgw"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "cft-mtls-api-mgmt-appgw"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "cft-mtls-api-mgmt-appgw"
          + id                         = (known after apply)
          + name                       = "cft-mtls-api-mgmt-appgw"
          + priority                   = 20
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "cft-mtls-api-mgmt-appgw-rewriterule"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (21 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1950,"Program":"tfcmt","SHA1":"","Target":"test_apim_appgw","Vars":{}} -->